mtosi1.1-TestSuite/TestsDefinitions/Notifications/examples/Notification_notify_alarm.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ../../../../xsd/common/Header.xsd tmf854.v1 ../../../../xsd/interfaces/ManagedElementMgr.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<header tmf854Version="1.1">
			<activityName>notify</activityName>
			<msgName>notify</msgName>
			<msgType>NOTIFICATION</msgType>
			<senderURI>/MTOSI/EMS01</senderURI>
			<destinationURI>/MTOSI/FaultOS</destinationURI>
			<communicationPattern>Notification</communicationPattern>
			<communicationStyle>MSG</communicationStyle>
			<timestamp>20051004140305</timestamp>
		</header>
	</soap:Header>
	<soap:Body>
		<notify tmf854Version="1.1">
			<topic>Fault</topic>
			<message>
				<Alarm>
					<eventInfo>
						<notificationId>00012011</notificationId>
						<objectName>
							<mdNm>Networks/XdrEMS/Server1 </mdNm>
							<meNm>768</meNm>
							<ptpNm>/shelf=1/slot=7/port=1</ptpNm>
						</objectName>
						<objectType>OT_PHYSICAL_TERMINATION_POINT</objectType>
						<osTime>20041106210687.3</osTime>
					</eventInfo>
					<isClearable>false</isClearable>
					<layerRate>LR_Line_OC48_STS48_and_MS_STM16</layerRate>
					<probableCause>
						<type>BER_SD</type>
					</probableCause>
					<perceivedSeverity>PS_CRITICAL</perceivedSeverity>
					<serviceAffecting>SA_SERVICE_AFFECTING</serviceAffecting>
					<rcaiIndicator>false</rcaiIndicator>
				</Alarm>
			</message>
		</notify>
	</soap:Body>
</soap:Envelope>
